var fests=[
{
	"name": "Incident",
	"image":"inci.jpg",
	"convenor" : "Adarsh Pai",
	 "id": "inci",
	"events":"1)There are a plethora of events including musical events, dance events, dramatics, art and literary events. These events witness participation from many colleges. <br><br> 2) The Pronite events, since its inception  have witnessed performances by top musicians like Sunidhi Chauhan, KK, Kunal Ganjawala, Nikhil Chinappa , DJ Oliver Moldan, Vishal - Shekhar, Salim - Suleiman and bands like Breathe Floyd, Led Zepplica, Mother Jane, Euphoria, Indian Ocean, Galeej Gurus, Parikrama and many more.<br><br>  3) There are also the Inci Specials, which are unique to the fest. Having beach events at our own beach has always been a major boost to the fest.",
	"description":" Incident is the annual cultural festival of NITK, generally held in the month of March. It is considered to be one of the biggest cultural festivals in India. Incident was started in the year 1980 and since then, it has grown by leaps and bounds to achieve its present stature. "
},
{
	"name": "Engineer",
	"image":"engineer.jpg",
	"convenor" : "Sachin Kumar",
	"id":"en",
	"events":"",
	"description":"As a fresher, you will most longingly look forward to your first college fest, ENGINEER, the annual technical symposium of NITK.Held usually in the month of October, Engi is all about putting your technical skills to the test and bringing forth the very best of it. It gives you the chance to explore the inner tech geek in you. Apart from participating in the events, you can also be a part of various committees such as Freefall and Pronites. Make sure you do volunteer, as it is a great way to gain some hands-on experience as well as get to know your seniors and batchmates. <br><br> Apart from a wide variety of scintillating events, what you should be looking forward to is the ‘block timing extensions’! From the very first day of college you will have to be back in your hostels by 7:00 p.m. (excluding block VII students), but during Engineer, block timings get extended till the end of that night's show, which is around 12 or 1 in the night, or rather morning. You will be free to roam around the campus, under a blanket of starry skies and it will, most surely, be an amazing experience. <br><br> For the events, there’s always something for every branch. You can also look forward to the Astro and Business events along with the most-awaited Pronites events like Laser show, Comedy show and DJ night!<br><br> The Mechanical events are one of the most awaited ones. From Bot Hockey to Wright Flight and many such events see active participation from many colleges, not only in and around Mangalore, but also from afar. The crowd puller event is Robo Wars where you can watch robots get (literally) crushed .It’s not always a great sight and you sometimes end up feeling sorry for the participants, watching their efforts go up in flames (really) . <br><br> For all the Googlers out there, Virtual Bounty is the event of your dreams. It is the online treasure hunt competition of Engineer. Some of you might be familiar with what an OTH is, for others it is basically “How well can you Google? “. VB goes on throughout the Engineer schedule; so when you come back to the hostels after a long day of events, there is always some excitement waiting for you online.<br><br> Inscription is the online competitive coding contest of Engineer. It is generally hosted on the Sphere Online Judge platform (SPOJ).<br><br> Then, there’s also CTF( Capture the flag) and Hackathon for the avid coders.<br><br> Ever dreamt of flying a spaceship? Here’s your chance. Don’t miss out on Orbiter, a flight simulator setup designed to give you the vibes and feels of the Martian terrain.<br><br> And if you want to spot the beautiful constellations in the night sky and listen to the stories of Greek Heroes after whom they were named, do go for Starry Nights.The Astro committee hosts other events too, such as Antariksh (exhibition) and Star Wars (quiz) as well. <br><br> The most captivating part of Engi is Technites, brought to you by the students who call themselves ‘the magicians of the after dark’. They truly do create sheer magic with their technical and creative skills; like making flames dance to the the tunes of the latest songs. Moreover, to see the fountains dance to your favourite tunes, do visit Symphony and to create music with your footsteps, just walk down the piano stairs.<br><br> For those of you who want to add onto your skill set and hence your career prospects, there’s a plethora of workshops conducted by experts. Ranging from Ethical Hacking to Bridge Design, there is no lack of options to choose from. Some of these might just roll over your ears, but it is definitely worth giving a shot.<br><br> For all those budding quizzers, there will be no dearth of quizzing competitions during Engineer. Almost every branch hosts its own quiz, apart from the general ones. There will also be panel discussions for the debating community and a Tech Speak with foreign professors joining us in person or via Skype.<br><br> Last few editions of Engi saw a new segment called Socially Conscious Engineering aimed at promoting awareness about the social responsibilities of an Engineer. Umbrella Walk was one of the signature events last year, which saw a huge turnout. It was a walk aiming to spread awareness mainly on depression. Some of the other events included illuminating the night sky with sky lanterns to symbolise that light can be found even in the darkest of times. Engi ‘17, the 13th edition of Engineer, is expected to surpass all expectations and has a devoted team working towards making it a success. The core team consists of Sachin Kumar (Convenor), Ashok Jangir (Joint Convenor) and Pratyush Giri (Treasurer). It is hoped that their vision and dedication will make the upcoming fest a great success."
}

// {

// 	"name": "Crresendo",
// 	"image":"crresendo.png",
// 	"convenor" : "",
// 	"id":"cr",
// 	"events":"1)There are a plethora of events including musical events, dance events, dramatics, art and literary events. These events witness participation from many colleges. <br><br> 2) The Pronite events, since its inception  have witnessed performances by top musicians like Sunidhi Chauhan, KK, Kunal Ganjawala, Nikhil Chinappa , DJ Oliver Moldan, Vishal - Shekhar, Salim - Suleiman and bands like Breathe Floyd, Led Zepplica, Mother Jane, Euphoria, Indian Ocean, Galeej Gurus, Parikrama and many more.<br><br>  3) There are also the Inci Specials, which are unique to the fest. Having beach events at our own beach has always been a major boost to the fest.",
// 	"description":" Incident is the annual cultural festival of NITK, generally held in the month of March. It is considered to be one of the biggest cultural festivals in India. Incident was started in the year 1980 and since then, it has grown by leaps and bounds to achieve its present stature. "
// },

// {

// 	"name": "Bharat Darshan",
// 	"image":"bd.png",
// 	"convenor" : "",
// 	"id":"bd",
// 	"events":"1)There are a plethora of events including musical events, dance events, dramatics, art and literary events. These events witness participation from many colleges. <br><br> 2) The Pronite events, since its inception  have witnessed performances by top musicians like Sunidhi Chauhan, KK, Kunal Ganjawala, Nikhil Chinappa , DJ Oliver Moldan, Vishal - Shekhar, Salim - Suleiman and bands like Breathe Floyd, Led Zepplica, Mother Jane, Euphoria, Indian Ocean, Galeej Gurus, Parikrama and many more.<br><br>  3) There are also the Inci Specials, which are unique to the fest. Having beach events at our own beach has always been a major boost to the fest.",
// 	"description":" Incident is the annual cultural festival of NITK, generally held in the month of March. It is considered to be one of the biggest cultural festivals in India. Incident was started in the year 1980 and since then, it has grown by leaps and bounds to achieve its present stature. "
// }

]
